In [1]:
import pandas as pd
import numpy as np

In [7]:
t = [5,'l',8,6]

In [8]:
pd.Series(t)

0    5
1    l
2    8
3    6
dtype: object

In [2]:
pd.Series([45,78,8,9,9,8,9,9,12])

0    45
1    78
2     8
3     9
4     9
5     8
6     9
7     9
8    12
dtype: int64

In [2]:
pd.Series([2,4,6])

0    2
1    4
2    6
dtype: int64

In [3]:
pd.Series([2,7,5], index = ['a','b','c'])

a    2
b    7
c    5
dtype: int64

In [10]:
s1 = pd.Series([3,5,7], index = ['a', 'b','c'])
s2 = pd.Series([5,7,9], index = ['a','b','f'])

In [11]:
s1

a    3
b    5
c    7
dtype: int64

In [12]:
s2

a    5
b    7
f    9
dtype: int64

In [13]:
s1 * s2

a    15.0
b    35.0
c     NaN
f     NaN
dtype: float64

In [14]:
s1 - s2

a   -2.0
b   -2.0
c    NaN
f    NaN
dtype: float64

In [15]:
s1 + s2

a     8.0
b    12.0
c     NaN
f     NaN
dtype: float64

In [17]:
df = pd.DataFrame(data=[[2,4,6,-1],[3,-4,2,-1],[-10,3,5,-7]],
                  columns=['c1','c2','c3','c4'],
                  index=['r1','r2','r3'])

In [19]:
df

    c1  c2  c3  c4
r1   2   4   6  -1
r2   3  -4   2  -1
r3 -10   3   5  -7

In [29]:
df.head()

    c1  c2  c3  c4
r1   2   4   6  -1
r2   3  -4   2  -1

In [28]:
df.tail()

    c1  c2  c3  c4
r1   2   4   6  -1
r2   3  -4   2  -1
r3 -10   3   5  -7

In [30]:
df[1:3]

    c1  c2  c3  c4
r2   3  -4   2  -1
r3 -10   3   5  -7

In [35]:
df["new"]=[7,5,4]

In [36]:
df

    c1  c2  c3  c4  new
r1   2   4   6  -1    7
r2   3  -4   2  -1    5
r3 -10   3   5  -7    4

In [37]:
df.loc['r4'] = [1.0, 6, 7, 9,8] #add a new row

In [38]:
df.head()

      c1   c2   c3   c4  new
r1   2.0  4.0  6.0 -1.0  7.0
r2   3.0 -4.0  2.0 -1.0  5.0
r3 -10.0  3.0  5.0 -7.0  4.0
r4   1.0  6.0  7.0  9.0  8.0

In [39]:
import pandas as pd
import numpy as np

# Handling missing data

In [40]:
df1 = pd.DataFrame([[np.nan, 3, 5, np.nan], [np.nan, 4, np.nan, 0], [np.nan, 5, 8, 0]], columns = list('ABCD'))

In [41]:
df1

    A  B    C    D
0 NaN  3  5.0  NaN
1 NaN  4  NaN  0.0
2 NaN  5  8.0  0.0

In [42]:
df1.dropna(axis=1)

   B
0  3
1  4
2  5

In [43]:
df1.dropna(axis=1, how='all')

   B    C    D
0  3  5.0  NaN
1  4  NaN  0.0
2  5  8.0  0.0

In [44]:
df1.dropna(axis=1,how='any')

   B
0  3
1  4
2  5

In [20]:
df1.dropna(axis=0, how='all')

    A  B    C    D
0 NaN  3  5.0  NaN
1 NaN  4  NaN  0.0
2 NaN  5  8.0  0.0

In [21]:
df1.dropna(axis=0,how='any')

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [53]:
df1['A'].dropna()

Series([], Name: A, dtype: float64)

In [45]:
df2=pd.DataFrame([[np.nan, 3, 5, np.nan], [np.nan, 4, np.nan, 0], [np.nan, 5, 8, 0]], columns = list('abcd'))

In [46]:
df2

    a  b    c    d
0 NaN  3  5.0  NaN
1 NaN  4  NaN  0.0
2 NaN  5  8.0  0.0

In [50]:
df2.fillna(2)

     a  b    c    d
0  2.0  3  5.0  2.0
1  2.0  4  2.0  0.0
2  2.0  5  8.0  0.0

In [51]:
df2['b'].fillna('a')

0    3
1    4
2    5
Name: b, dtype: int64

In [24]:
r=df2['c'].fillna('o')

In [25]:
r

0    5
1    o
2    8
Name: c, dtype: object

In [34]:
df2['b'].mean()

4.0

In [32]:
df2['c'].mean()

6.5

In [26]:
m=df2['c'].fillna(df2['c'].mean())

In [ ]:
df['sales'].fillna(df[sales].mean())

In [38]:
q=df2.replace(0.0, 'There was zero')

In [39]:
q

    a  b    c               d
0 NaN  3  5.0             NaN
1 NaN  4  NaN  There was zero
2 NaN  5  8.0  There was zero

In [40]:
t=df2.replace(np.nan,'There was missing value')

In [39]:
t

,a,b,c,d
0,There was missing value,3,5,There was missing value
1,There was missing value,4,There was missing value,0
2,There was missing value,5,8,0

# READ WRITE FILES

In [29]:
df3=pd.DataFrame(data=[[2,3,5],['hi','hello','python'],[34,True, False]], index= ['R1','R2','R3'])

In [30]:
df3

     0      1       2
R1   2      3       5
R2  hi  hello  python
R3  34   True   False

In [42]:
df3.to_csv('samplcsv.csv')